#Дана строка. Преобразовать в ней все прописные латинские буквы в строчные
#
string = input()
print(string.lower())